print("Завдання 1: ")
#Запросити користувача 5 чисел і записати їх до списку

numbers = input("Введіть п'ять чисел, через пробіл: ").split()
List = list(map(int, numbers))

print(List)

print("\nЗавдання 2: ")
# Даний список A = [1, 2, 3, 4, 5]
# Видалити останнє число зі списку

A = [1, 2, 3, 4, 5]
A.pop()

print(A)

print("\nЗавдання 3: ")
# Запросити користувача 10 чисел і записати їх до списку A
# Запросити у користувача число N
# Вивести користувачу скільки у списку A повторюється число N

numbers = input("Введіть дес'ять чисел, через пробіл: ").split()
А = list(map(int, numbers))
N = int(input('Введіть число яке треба порахувати: '))

print(А.count(N))

print("\nЗавдання 4: ")
# Запросити у користувача число N
# Запросити користувача N чисел і записати їх до списку A
# Вивести список у зворотній послідовності

N = input('Введіть число: ')

B = input("Введіть " + N + " чисел, через пробіл: ").split()
#B = list(map(int, numbers))
B.reverse()

print(' '.join(B))

print("\nЗавдання 5: ")
#Запросити користувача 5 чисел і записати їх до списку A
#Записати всі числа зі списку A які більше 5 до списку C

N = input("Введіть п'ять чисел, через пробіл: ").split()
B = list(map(int, N))

for i in B:
    if i > 5:
        print(i, end=" ")

print("\nЗавдання 6: ")
# Запросити у користувача число N
# Запросити користувача N цілих чисел і записати їх до списку A
# Знайти в ньому мінімальну та максимальну кількість за допомогою циклу
# (заборонено використовувати функцію min, max, sorted, sort). Вивести ці числа.

N = input('Введіть число: ')
numbers = input("Введіть " + N + " чисел, через пробіл: ").split()
A = list(map(int, numbers))

max_value, min_value = A[0], A[0]

for i in range(len(A)):
    if A[i]>max_value:
        max_value=A[i]
    if A[i]<min_value:
        min_value=A[i]

print ("Найбільший елемент =", max_value)
print ("Найменьший елемент =", min_value)

print("\nЗавдання 7: ")
# Користувач вводить текст потрібно вивести кількість цифр у цьому тексті
# Приклад:
# > 'Lorem 222 ipsum, 123 dolor 1 sit amet
# Кількість цифр: 7

Text = list(input('Введіть текст: '))
num_value = [int(i) for i in Text if i.isdigit()]
print('Кількість цифр в тексті =', len(num_value))
