
# Овен =  (21.03 – 20.04)
# Телець (21.04 – 21.05)
# Близнята (22.05 – 21.06)
# Рак (22.06 – 22.07)
# Лев (23.07 – 21.08)
# Діва (22.08 – 23.09)
# Терези (24.09 – 23.10)
# Скорпіон (24.10 – 22.11)
# Стрілець (23.11 – 21.12)
# Козеріг (22.12 – 20.01)
# Водолій (21.01 – 18.02)
# Риби (19.02 – 20.03)

import calendar
from datetime import date

day = int(input("\nВведіть день вашого народження: "))
month: int = int(input("\nВведіть місяць вашого народження: "))
year = int(input("\nВведіть рік вашого народження: "))

if not (1 <= month <= 12 and 1900 <= year <= 2100):
    print("\nПОМИЛКА!!! перевірте правельніть введених даних: день, місяць, рік")
    exit()

max_day = calendar.monthrange(year, month)[1]

if not (1 <= day <= max_day):
    print("\nПОМИЛКА!!! перевірте правельніть введених даних: день, місяць, рік!!!")
    exit()

Udate = date(year, month, day)

if date(year, 3, 21) <= Udate <= date(year, 4, 20):
    print("\nГороскоп на 24-30 квітня 2023 року, для знаку зодіака - ОВЕН\nВ оточенні можуть з'явитися люди з минулого, які допоможуть втілити дещо раніше задумане. Однак будьте обачнішими\n— ваша фантазія може перевищувати фінансові можливості. Головні зміни цього періоду – рух уперед та гарний настрій.\nАктивізуються зв'язки з колегами з інших міст чи країн, можлива поїздка або конструктивні переговори з партнерами здалеку.\nОновлення торкнеться всіх сфер вашої діяльності.")

if date(year, 4, 21) <= Udate <= date(year, 5, 21):
    print("\nГороскоп на 24-30 квітня 2023 року, для знаку зодіака - ТЕЛЕЦЬ\nРозбіжності з опонентами, що мали місце в минулому, матимуть цілком переборний вигляд. Можливо, допомога прийде від\nвпливових людей або від старих друзів та знайомих. Бізнесменам варто пам'ятати про податки та вести свою справ\nмаксимально прозоро. У найманого співробітника з'явиться реальна перспектива отримати іншу, цікавішу, роботу або зміцнити\nсвої позиції на колишньому місці. Найкращим рішенням стануть вкладення в нерухомість на вторинному ринку.")

if date(year, 5, 22) <= Udate <= date(year, 6, 21):
    print("\nГороскоп на 24-30 квітня 2023 року, для знаку зодіака - БЛИЗНЯТА\nГарний прибуток можливий у тих, хто займається логістикою та зовнішньоекономічною діяльністю. Тиждень виявиться більш\nпродуктивним у плані дохідності. У сімейному житті зараз буде все спокійно. Гарний час для того, щоб усіляко піклуватися\nодне про одного, закликаючи на допомогу мудрість та кохання. У разі проблем на роботі або зі здоров'ям ви можете\nсміливо розраховувати на свого партнера – він зробить вам все, що йому до снаги.\nЯкщо ви молодята, то можлива напруженість через фінансові питання.")

if date(year, 6, 22) <= Udate <= date(year, 7, 22):
    print("\nГороскоп на 24-30 квітня 2023 року, для знаку зодіака - РАК\nСкладні стосунки із родичами поступово врегулюються, і цей позитивний процес надихне вас на зміцнення зв'язків. Самотні серця\nзможуть нарешті піти на побачення і показати себе у всій красі. Намагайтеся проявляти активність у соцмережах.\nЦілком можлива зустріч із давнім знайомим, яка переросте у романтичні стосунки. У цей період імунна система буде дещо\nослаблена, тому якнайбільше відпочивайте і не забувайте про здорове харчування.")

if date(year, 7, 23) <= Udate <= date(year, 8, 21):
    print("\nГороскоп на 24-30 квітня 2023 року, для знаку зодіака - ЛЕВ\nДопомога ближньому, добрі справи, благодійність сприяють очищенню від кармічних боргів, які переслідують представників\nцього знаку зодіаку. Дуже зручний час для отримання нових знань і розширення світогляду. Зірки радять віддати перевагу\nне модним марафонам особистісного зростання, а чомусь більш практичному та утилітарному, наприклад, курсам із дизайну\nінтер'єру. Але для походу до стиліста чи косметолога тиждень абсолютно не підходить.")

if date(year, 8, 22) <= Udate <= date(year, 9, 23):
    print("\nГороскоп на 24-30 квітня 2023 року, для знаку зодіака - ДІВА\nЗагострюється самокритичність, особливо стосовно власної зовнішності. Але в жодному разі не варто відвідувати салони\nкраси – результат точно не потішить. Фізичних і психічних сил бракує для досягнення ефективних практичних результатів.\nНамагайтеся не дати уяві відвести вас у світ ілюзій. Попри весь цей хаос, в особистому житті все чудово. Люди з минулого\nдопомагають подивитися інакше на те, що відбувається, і знайти додаткові ресурси.")

if date(year, 9, 24) <= Udate <= date(year, 10, 23):
    print("\nГороскоп на 24-30 квітня 2023 року, для знаку зодіака - ТЕРЕЗИ\nВаше невдоволення собою та результатами своєї роботи може досягти такого ступеня, що знадобиться співчуття та участь\nу ваших справах з боку близьких. Вчинки все більш імпульсивні та спонтанні, а бажання – егоїстичні. Пристрасть і романтика\n можуть вас поманити, але навряд чи взаємний порив збережеться надовго. Уникнути конфліктів буде дуже непросто\nпротягом тижня, тому намагайтеся проводити час лише з коханими та рідними людьми, відсікаючи всі токсичні зв'язки.")

if date(year, 10, 24) <= Udate <= date(year, 11, 22):
    print("\nГороскоп на 24-30 квітня 2023 року, для знаку зодіака - СКОРПІОН\nБажань, часом зовсім нездійсненних, стає дедалі більше. Діліться своїми думками з іншими людьми, обговорюйте те,\nщо відбувається, і ви зможете знайти можливості, знайти ключі для того, щоб розпочати новий етап у своєму житті.\nЕнергії достатньо для активної фізичної роботи, тому бажано направити її на добрі справи. У всіх справах ви можете\nрозраховувати на партнерів у спільній справі – їхня допомога буде дієвою, і не лише моральною, а й матеріальною.")

if date(year, 11, 23) <= Udate <= date(year, 12, 21):
    print("\nГороскоп на 24-30 квітня 2023 року, для знаку зодіака - СТРІЛЕЦЬ\nНе варто дивуватися, якщо все піде навскіс: прилади будуть ламатися, документи губитися, непорозуміння зростатиме.\nПрояв ініціативи та активність у фінансовій сфері спричинять безліч неприємностей. Найкраще зараз відпочити, переглянути\nсвої відносини з грошима, знайти плюси та мінуси у діловому партнерстві, щоб для себе ухвалити правильні рішення.\nКонкуренти сильні, тож якщо не хочете нажити собі ворогів, не афішуйте свої справи.")

if (date(year, 12, 22) <= Udate <= date(year, 12, 31)) or (date(year, 1, 1) <= Udate <= date(year, 1, 20)):
    print("\nГороскоп на 24-30 квітня 2023 року, для знаку зодіака - КОЗОРІГ\nВаша заповзятливість зростає, посилюються лідерські якості. Ви дуже сильно впливаєте на найближче оточення, можете\nвпливати на їх мислення. До вас дослухаються, але це накладає на вас додаткову відповідальність. Часу на себе практично\nне вистачає, багато роботи, побутових турбот та турбот. Ваші аналітичні здібності допомагають поєднати розум та\nінтуїцію в єдине ціле, що сприяє прийняттю вірних рішень, що ведуть до успіху.")

if date(year, 1, 21) <= Udate <= date(year, 2, 18):
    print("\nГороскоп на 24-30 квітня 2023 року, для знаку зодіака - ВОДОЛІЙ\nВеличезна кількість побутових неприємностей, турботи і термінові справи, які раптом навалилися, значно зіпсують настрій.\nПроте поточний тиждень принесе безліч чудових емоцій і зустрічей із людьми з минулого, а також нових знайомств.\nІ навіть якщо роман, що раптом спалахнув, буде недовговічним, він залишить тільки приємні спогади.\nНе шукайте недоліків у своєму партнері, не критикуйте колег і не засуджуйте оточення за повільність!\nНасолоджуйтесь моментом і не поспішайте!")

if date(year, 2, 19) <= Udate <= date(year, 3, 20):
    print("\nГороскоп на 24-30 квітня 2023 року, для знаку зодіака - РИБИ\nВаші прибутки будуть безпосередньо пов'язані з раніше виконаною роботою. Якщо ви відповідальні та пунктуальні – чекайте\nна грошові надходження. Якщо все зовсім інакше, то настав час переглянути своє ставлення до професійної сфери\nі навести лад у справах. Те, що відбувається цього тижня, буде важливим і наступні кілька місяців.\nМожливі юридичні складнощі, різні штрафи, може виникнути потреба відвідати офіційні інстанції.")


