
# Овен (21.03 – 20.04)
# Телець (21.04 – 21.05)
# Близнята (22.05 – 21.06)
# Рак (22.06 – 22.07)
# Лев (23.07 – 21.08)
# Діва (22.08 – 23.09)
# Терези (24.09 – 23.10)
# Скорпіон (24.10 – 22.11)
# Стрілець (23.11 – 21.12)
# Козеріг (22.12 – 20.01)
# Водолій (21.01 – 18.02)
# Риби (19.02 – 20.03)

from datetime import date

day = int(input("Введіть день вашого народження: "))
month = int(input("Введіть місяць вашого народження: "))
year = int(input("Введіть рік вашого народження: "))

if not (1 <= day <= 31 and 1 <= month <= 12 and 1900 <= year <= 2100):
    print("Введені день, місяць або рік не вірні!")
    exit()

Udate = date(year, month, day)

if date(year, 3, 21) <= Udate <= date(year, 4, 20):
    print("Гороскоп на 24-30 квітня 2023 року, для знаку зодіака - ОВЕН\nВ оточенні можуть з'явитися люди з минулого, які допоможуть втілити дещо раніше задумане. Однак будьте обачнішими\n— ваша фантазія може перевищувати фінансові можливості. Головні зміни цього періоду – рух уперед та гарний настрій.\nАктивізуються зв'язки з колегами з інших міст чи країн, можлива поїздка або конструктивні переговори з партнерами здалеку.\nОновлення торкнеться всіх сфер вашої діяльності.")

if date(year, 4, 21) <= Udate <= date(year, 5, 21):
    print("Гороскоп на 24-30 квітня 2023 року, для знаку зодіака - ТЕЛЕЦЬ\nРозбіжності з опонентами, що мали місце в минулому, матимуть цілком переборний вигляд. Можливо, допомога прийде від\nвпливових людей або від старих друзів та знайомих. Бізнесменам варто пам'ятати про податки та вести свою справ\nмаксимально прозоро. У найманого співробітника з'явиться реальна перспектива отримати іншу, цікавішу, роботу або зміцнити\nсвої позиції на колишньому місці. Найкращим рішенням стануть вкладення в нерухомість на вторинному ринку.")

if date(year, 5, 22) <= Udate <= date(year, 6, 21):
    print("Гороскоп на 24-30 квітня 2023 року, для знаку зодіака - БЛИЗНЯТА\nГарний прибуток можливий у тих, хто займається логістикою та зовнішньоекономічною діяльністю. Тиждень виявиться більш\nпродуктивним у плані дохідності. У сімейному житті зараз буде все спокійно. Гарний час для того, щоб усіляко піклуватися\nодне про одного, закликаючи на допомогу мудрість та кохання. У разі проблем на роботі або зі здоров'ям ви можете\nсміливо розраховувати на свого партнера – він зробить вам все, що йому до снаги.\nЯкщо ви молодята, то можлива напруженість через фінансові питання.")

if date(year, 6, 22) <= Udate <= date(year, 7, 22):
    print("Гороскоп на 24-30 квітня 2023 року, для знаку зодіака - БЛИЗНЯТА\n

if date(year, 7, 23) <= Udate <= date(year, 8, 21):
    print("Гороскоп на 24-30 квітня 2023 року, для знаку зодіака - БЛИЗНЯТА\n

if date(year, 8, 22) <= Udate <= date(year, 9, 23):
    print("Гороскоп на 24-30 квітня 2023 року, для знаку зодіака - БЛИЗНЯТА\n

if date(year, 9, 24) <= Udate <= date(year, 10, 23):
    print("Гороскоп на 24-30 квітня 2023 року, для знаку зодіака - БЛИЗНЯТА\n

if date(year, 10, 24) <= Udate <= date(year, 11, 22):
    print("Гороскоп на 24-30 квітня 2023 року, для знаку зодіака - БЛИЗНЯТА\n

if date(year, 11, 23) <= Udate <= date(year, 12, 21):
    print("Гороскоп на 24-30 квітня 2023 року, для знаку зодіака - БЛИЗНЯТА\n

if date(year, 12, 22) <= Udate <= date(year, 1, 20):
    print("Гороскоп на 24-30 квітня 2023 року, для знаку зодіака - БЛИЗНЯТА\n

if date(year, 1, 21) <= Udate <= date(year, 2, 18):
    print("Гороскоп на 24-30 квітня 2023 року, для знаку зодіака - БЛИЗНЯТА\n

if date(year, 2, 19) <= Udate <= date(year, 3, 20):
    print("Гороскоп на 24-30 квітня 2023 року, для знаку зодіака - БЛИЗНЯТА\n