# Вірус пошкодив систему доступу до файлів. Відомо, що над кожним файлом можна робити певні дії:
# запис – W;
# читання – R;
# запуск - X.
#
# На вхід програмі подається:
# число n – кількість файлів;
# n рядків з іменами файлів та допустимими операціями;
# число m – кількість запитів до файлів;
# m запитів виду "операція файл".
#
# Для кожного припустимого запиту програма має повертати OK, для неприпустимого – Access denied.
#
#
#
# Приклад введення:
#
# 3
# python.exe X
# book.txt R W
# notebook.exe R W X
# 5
# read python.exe
# read book.txt
# write notebook.exe
# execute notebook.exe
# write book.txt
#
#
# Приклад виводу:
#
# Access denied
# OK
# OK
# OK
# OK